jimmywong2003/SSD1306-LCD-on-NRF52/ble_app_uart_ssd1306/main.c
        *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
        nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
}


void testdrawchar(void)
{
        ssd1306_clear_display();
        ssd1306_set_textsize(1);
        ssd1306_set_textcolor(WHITE);
        ssd1306_set_cursor(0, 0);

        for (uint8_t i = 0; i < 168; i++) {
                if (i == '\n') continue;
                ssd1306_write(i);
                if ((i > 0) && (i % 21 == 0))
                        ssd1306_write('\n');
        }
        ssd1306_display();
}


void testdrawline(void)
{
        for (int16_t i = 0; i < ssd1306_width(); i += 4) {
                ssd1306_draw_line(0, 0, i, ssd1306_height() - 1, WHITE);
                ssd1306_display();
        }
        for (int16_t i = 0; i < ssd1306_height(); i += 4) {
                ssd1306_draw_line(0, 0, ssd1306_width() - 1, i, WHITE);
                ssd1306_display();
        }
        nrf_delay_ms(250);

        ssd1306_clear_display();
        for (int16_t i = 0; i < ssd1306_width(); i += 4) {
                ssd1306_draw_line(0, ssd1306_height() - 1, i, 0, WHITE);
                ssd1306_display();
        }
        for (int16_t i = ssd1306_height() - 1; i >= 0; i -= 4) {
                ssd1306_draw_line(0, ssd1306_height() - 1, ssd1306_width() - 1, i, WHITE);
                ssd1306_display();
        }
        nrf_delay_ms(250);

        ssd1306_clear_display();
        for (int16_t i = ssd1306_width() - 1; i >= 0; i -= 4) {
                ssd1306_draw_line(ssd1306_width() - 1, ssd1306_height() - 1, i, 0, WHITE);
                ssd1306_display();
        }
        for (int16_t i = ssd1306_height() - 1; i >= 0; i -= 4) {
                ssd1306_draw_line(ssd1306_width() - 1, ssd1306_height() - 1, 0, i, WHITE);
                ssd1306_display();
        }
        nrf_delay_ms(250);

        ssd1306_clear_display();
        for (int16_t i = 0; i < ssd1306_height(); i += 4) {
                ssd1306_draw_line(ssd1306_width() - 1, 0, 0, i, WHITE);
                ssd1306_display();
        }
        for (int16_t i = 0; i < ssd1306_width(); i += 4) {
                ssd1306_draw_line(ssd1306_width() - 1, 0, i, ssd1306_height() - 1, WHITE);
                ssd1306_display();
        }
        nrf_delay_ms(250);

        ssd1306_display();
        nrf_delay_ms(250);
        ssd1306_clear_display();
}


void testdrawbitmap(const uint8_t *bitmap, uint8_t w, uint8_t h)
{
#define NUMFLAKES 10
#define XPOS 0
#define YPOS 1
#define DELTAY 2

        uint8_t icons[NUMFLAKES][3];

        // initialize
        for (uint8_t f = 0; f < NUMFLAKES; f++) {
                icons[f][XPOS] = rand() % ssd1306_width();
                icons[f][YPOS] = 0;
                icons[f][DELTAY] = (rand() % 5) + 1;
        }

        while (1) {
                // draw each icon
                for (uint8_t f = 0; f < NUMFLAKES; f++) {
                        ssd1306_draw_bitmap(icons[f][XPOS], icons[f][YPOS], logo16_glcd_bmp, w, h, WHITE);
                }
                ssd1306_display();
                nrf_delay_ms(200);

                // then erase it + move it
                for (uint8_t f = 0; f < NUMFLAKES; f++) {
                        ssd1306_draw_bitmap(icons[f][XPOS], icons[f][YPOS],  logo16_glcd_bmp, w, h, BLACK);
                        // move it
                        icons[f][YPOS] += icons[f][DELTAY];
                        // if its gone, reinit
                        if (icons[f][YPOS] > ssd1306_height()) {
                                icons[f][XPOS] = rand() % ssd1306_width();
                                icons[f][YPOS] = 0;
                                icons[f][DELTAY] = (rand() % 5) + 1;
                        }
                }
        }
}

/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;
        uint32_t count = 0;

        // Initialize.
        uart_init();
        log_init();
        timers_init();
        buttons_leds_init(&erase_bonds);
        power_management_init();
        ble_stack_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        printf("\r\nUART started.\r\n");
        NRF_LOG_INFO("Debug logging for UART over RTT started.");
        advertising_start();

        nrf_gpio_cfg(
                SSD1306_CONFIG_VDD_PIN,
                NRF_GPIO_PIN_DIR_OUTPUT,
                NRF_GPIO_PIN_INPUT_DISCONNECT,
                NRF_GPIO_PIN_NOPULL,
                NRF_GPIO_PIN_H0S1,
                NRF_GPIO_PIN_NOSENSE);

        nrf_gpio_pin_set(SSD1306_CONFIG_VDD_PIN);

        ssd1306_init_i2c(SSD1306_CONFIG_SCL_PIN, SSD1306_CONFIG_SDA_PIN);
        ssd1306_begin(SSD1306_SWITCHCAPVCC, SSD1306_I2C_ADDRESS, false);

        nrf_delay_ms(1000);

        NRF_LOG_INFO("--- START ---");

        nrf_delay_ms(1000);
        ssd1306_display();
        nrf_delay_ms(DELAY_MS);

        NRF_LOG_INFO("--- testdrawline ---");
        //
        ssd1306_draw_circle(SSD1306_LCDWIDTH / 2, SSD1306_LCDHEIGHT / 2, 30, WHITE);
        ssd1306_display();


        // Enter main loop.
        for (;;)
        {
                ssd1306_clear_display();
                // draw a single pixel
                ssd1306_draw_pixel(10, 10, WHITE);
                ssd1306_display();
                nrf_delay_ms(DELAY_MS);

                ssd1306_draw_circle(SSD1306_LCDWIDTH / 2, SSD1306_LCDHEIGHT / 2, 30, WHITE);
                ssd1306_display();
                nrf_delay_ms(DELAY_MS);

                testdrawchar();
                nrf_delay_ms(DELAY_MS);

                ssd1306_clear_display();
                ssd1306_display();
                nrf_delay_ms(DELAY_MS);

                testdrawline();

                ssd1306_clear_display();
                ssd1306_draw_bitmap(30, 16,  logo16_glcd_bmp, 16, 16, 1);
                ssd1306_display();
                nrf_delay_ms(DELAY_MS);

                // draw a bitmap icon and 'animate' movement
                testdrawbitmap(logo16_glcd_bmp, LOGO16_GLCD_HEIGHT, LOGO16_GLCD_WIDTH);

                NRF_LOG_INFO("Count = %04d", count++);
                idle_state_handle();
        }
}


/**
 * @}
 */
